app/controllers/filters_controller.rb

SELECT "reports".* FROM "reports" WHERE "reports"."id" = 1
---
def new
  @report = Report.find(params[:report])

SELECT "reports".* FROM "reports" WHERE "reports"."id" = 2
INSERT INTO "filters" ("name", "report_id", "field_name", "operation", "value", "created_at", "updated_at") VALUES ('XXXXXXXXXXXXXXXXXXXXX', NULL, NULL, NULL, NULL, '2011-05-24 03:25:11', '2011-05-24 03:25:11')
---
def create
  @filter = Filter.new(params[:filter])
  @report = Report.find(@filter.report_id)
#  puts "#########3########## report id: #{@report.id}"
#  puts @report
  #@filter = @report.filters.build(params[:filter])
  if @filter.save

SELECT "filters".* FROM "filters" WHERE "filters"."id" = 1
---
def edit
  @filter = Filter.find(params[:id])

SELECT "filters".* FROM "filters" WHERE "filters"."id" = 1
UPDATE "filters" SET "name" = 'recordCount', "field_name" = 'recordCound', "operation" = '<', "value" = '500', "updated_at" = '2011-06-24 04:23:57' WHERE "filters"."id" = 13
---
def update

  @filter = Filter.find(params[:id])
  @report = @filter.report
  if @filter.update_attributes(params[:filter])