app/controllers/reports_controller.rb

  def show
    @report = Report.find(params[:id])
---
SELECT TOP #<Arel::Nodes::Limit:0x255be08> "reports".* FROM "reports" WHERE "reports"."id" = 3

  def edit
    @report = Report.find(params[:id])
---
SELECT TOP #<Arel::Nodes::Limit:0x11e1dd8> "reports".* FROM "reports" WHERE "reports"."id" = 1

  def create
    @report = Report.new(params[:report])

    if @report.save
---
INSERT INTO "reports" ("name", "code", "file_name", "is_secured", "created_at", "updated_at", "report_group", "date_range", "record_count", "security") VALUES ('', '', '', 0, '2011-06-27 06:45:55', '2011-06-27 06:45:55', '', NULL, NULL, NULL)

  def update
    @report = Report.find(params[:id])

    respond_to do |format|
      if @report.update_attributes(params[:report])
---
SELECT "reports".* FROM "reports" WHERE "reports"."id" = 1
UPDATE "reports" SET "name" = 'Candidate police and medical Check', "code" = 'CAN-001', "report_group" = 'Candidate', "is_secured" = 1, "date_range" = -1, "record_count" = 200, "security" = 2, "updated_at" = '2011-06-28 00:59:13' WHERE "reports"."id" = 13

  def destroy
    @report = Report.find(params[:id])
    @report.destroy
---
SELECT "reports".* FROM "reports" WHERE "reports"."id" = 12
DELETE FROM "reports" WHERE "reports"."id" = 12